package com.example.final_work;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;
import android.os.Bundle;
import java.util.ArrayList;


public class midicine extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_midicine);

ArrayList<mid> mymid =new ArrayList<>();

        mid m1 =new mid("السرطان","سيكلوفوسفاميد","السيكلوفوسفاميد","سيكلوفوسفامد","سيتوكسان","إندوكسان","اندوكسان","الاندوكسان","ايندوكسان","نيوسار","جيفتانا","ميتوميسين C","ميثوتريكسيت ايبوي","ميثوتريكسيت","ميثوتركسات","الميثوتركسات","الميثوتريكسات","الميتوتركسان","ميتوتركسات","","","","","");
        mid m2 =new mid("الاكتئاب","إيدروناكس","سولوتك","سولوتيك","افكسور","ايفكسور","سبرام","سيتالوجين","سيتالوبرام هيكسال","سيتالوبرام","ليسيتال","لوبرا","لوبرام","فافرين","فافرين","لوفوكس","ميرزاجن","ريميرون","سيرزون","سبراليكس","سيبرالكس","سيبرالكس","اينتابرو","انتبرو");
        mid m3 =new mid("الإدز","سيلزينتري","سيلزنتري","فديكس","فيراميون","تريزيفير","زياجين","زياجين 300","رياتاز","انتيلينس","ايمريفا","كريكسيفان","ستوكرين","ستوكرين","سوستيفا","فيوزيون","تروفادا","فيريد","بريزيستا","ايسنترس","نورفير","ريتروفير","فورتوفيز","إنفيراس");
        mid m4 =new mid("الحساسية","بيتاكورت","هيسمانال","ادرينالين","ابينفرين","بوديار","بيودينيد","انيماكورت","انتوكورت","بولميكورت","بلميكروت","بولميكورت","بلميكورت","رينوكورت","رينوكورت","رينوكورت","سمبيطورت","بيتاسال","بيتا فال","بيتافال","بيتافال ان","بيتنوفيت","بيتنوفات","ديبرولين");
        mid m5 =new mid("القلق","سولوتك","سولوتيك","افكسور","ايفكسور","ميلاريل","فافرين","لوفوكس","سبراليكس","سيبرالكس","اينتابرو","انتابرو","زيلاكس","زيلاكس","زاناكس","اكساناكس","اكزانيكس","إيمبركس","تفرانيل","توفرانيل","سيراكس","سيريباكس","ديروكسات","باروكسات");
        mid m6 =new mid("مرض السكري","جلوريون","غلوريون","جلوريون","جلوريون","افانديا","ديابين","اكاروز","اكاروس","اكاروس اقراص","جلوكوباي","غلوكوباي","بييتا","اكترابيد","اكترابيد انسولين","اكترابيد","ابيدرا","أبيدارسولوستار","هومولوغ","هوومالوغ","هومولوغ","هومولوغ ميكس","هيومولين","هيوميولين");
        mid m7 =new mid("ارتفاع الكولسترول","ليبيتور","ليبتور","استاتين","اتورفا","ليبودار","تورفاكول","ترافاكول","ايزيترول","اينيجي","اينيجي اقراص","انيجي","زيتيا","ليبوستات","ليبوستات اقراص","برافاكول","كريستور","الكريستور","استابرول","ليبانور","موداليم","سيماغا","سيمفاهيكسيل","سيمفاهيكسيل");
        mid m8 =new mid("الهربس التناسلي","اسيكلين","اسيفير","كلوفر","ديفوراكس","ايمافير","نوفيرال","زوفيراكس","زوفيراكس250MG","فالتريكس","فامفير125MGTAB","فامفير 250MGTAB","","","","","","","","","","","","");
        mid m9 =new mid("الصرع","ليريكا150","ليريكا25","ليركا","ليريكا50","ليريكا75","نيورونتين","ابانيوتن","فينتوليب","تريليبتال","تريليبتال اقراص","ترليبتال","ايبراماكس","توباماكس","توباماكس15MG","توباماكس200MG","توباماكس25MG","دياموكس","دياموكس ساستيتس","دياموكس اقراص 125MG","دياموكس","زارونتين","مايسولين","جابانت");
        mid m10 =new mid("حب الشباب","مينيس","دلاسين - سي","سيليت","ديان","ايفرا","جراسيال","جينيرا","لوجينون","مارفيلون","نوفارينج","ريجلون","ياسمين","كريم ادولين","ادولين","كريم ديفيرين","ديفيرين","سوريكور","كريم واتين","واتين","امبيراسين","اوكسيتتراسيكلين","ايزوتريكس","زيراكتان");
        mid m11 =new mid("الم الظهر","الجونال","دولومول120MG","دولومول325MG","دولومول500MG","دولومول650MG","دولومول120MG-5ML","نيمالوكس","سوليد","فينتور","ادول","سيفامول","ريفانين125MG","ريفانين125MG-5ML","تيلينول","دارفون","ويجيسيك","كامبيا","كاتافلام","روفيناك","فولتارين","زيبسور","كابسين","كوتينزا");
        mid m12 =new mid("الزهايمر","كوجنكس","رازادين","ريمينيل","ريمينيل كبسولات","ريمانيل","ريمينيل 4","ريمينال اقراص","ريمينيل 8","ريمنيل","اريسبت","دوزيل","اكسيلون","اكسيلون2MG","ايكسيلون3MG","اكسيلون4.5MG","اكسيلون4.6MG","اكسييلون6MG","ايكسيلون9.5MG","ابيكسا","ناميندا","","","");
        mid m13 =new mid("الربو","بيتاكورت","ميدرول","سولو ميدرول","افدرين","ادرينالين","ابينفرين","امينوفيللين","امينوفيلين","امينوفيلين","نيوفيلين","فيلوكونتين","تروفيلين","زولير","ميتيكورتين","أوراسون","بريدون","بريدون","سترابريد","بوديار","بيودينيد","انيماكورت","انتوكورت","بولميكورت");
        mid m14 =new mid("التصلب اللويحي","اندوبيولين","جاماجارد","انتراغلوبين","انتراجلوبين","اينتراغلوبين","انتراتيكت","فيجام","جابلوفين","ليوريسال","ليورسال اقراص","مابثيرا","ريتوكسان","كوبوليمر - 1","تايسابري","","","","","","","","","");
        mid m15 =new mid("سرطان الثدي","بروفيرا","فيمارا","بريمارا","ايبيتاكسيل","تاكسول","افاستين","نولفاديكس","سولتاموكس","هيرسبتين","تاكسوتير","تاكسوتر","زولادكس","ادروسيل","فلورويراسيل","فلوراوريوراسيل","فلورويوراسيل","فلورويوراسيل","اونكوفين","ديبو بروفيرا","","","","");
        mid m16 =new mid("الصدفية","ميدرول","سولو ميدرول","تيجازون","نيوتيجاسون","نيوتجسون","سورياتين","اميفايف","ريميكاد","انبريل","رابتيفا","أفيج","فابيور","تازوراك","سيناطتين","كينوكورت","كيناكومب","كيناكورت","كينالوج","كريم بانديرم ","بانديرم","بيفيزون","كيراسال","ميكانول");
        mid m17 =new mid("الدوالي","اسكليرا","","","","","","","","","","","","","","","","","","","","","","");
        mid m18 =new mid("انقطاع الدورة الشهرية","نيورونتين","بروفيرا","كليمن","إيستراديرم","استراديرم","استرادرم","فيموستون","الفيموستون","فيمستون","بروجيلوتون","فاجيفيم","بريماران","اورثو - جينيست","ليفيال","جابانت","غابانت","جابين","جابنتين","هوريزانت","نيوروبلكس","انجيليك","دوفاستون","ايفستا");
        mid m19 =new mid("الشقيقة","اسبرين","الجونال","نوروفين","كيديبرين","دولومول","دولومول325MG","دولومول500MG","دولومول650MG","دولومول120MG - 5ML","ايميججران","اميجران10MG","اميجران20MG","اميجران0.5ML","ميجرابان100MG","ميجرابان50MG","اوراتاب","ادبرين","الكا-زلتسر","اسبرين","اسبرين الاطفال","الأسبرين","ديسبرين","جوسبرين");
        mid m20 =new mid("سرطان الدم","ادريبلاستينا","ادريبلاستين","فيدازا","ترايسينوكس","اندوبيولين","جاماجارد","انتراغلوبين","انترغلوبين","انتراتيكت","فيجام","كامباث","ليماترادا","","","","","","","","","","","");
        mid m21 =new mid("التهاب المفاصل","اندومين","اندومين كبسولات","ميدرول","سولوميدرول","لودين","نيمالوكس","سوليد","فينتور","هيوميرا","كونفورتد","كونفورتد كبسولات","كونفورتد حقن","كونفورتد","","","","","","","","","","");
        mid m22 =new mid("النوبة القلبية","اسبرين","كيديبرين","كلوبيكس","بيدوفكس","بلافيكس","بيتاتين اقراص","بيتاتين","كانار","كاردول","نورموتين","نورموتين اقراص","نوفو - اتينولول","بريسلو","","","","","","","","","","");
        mid m23 =new mid("سرطان القولون","كامبتو","كامبتوسار","ايلوكساتين","الوكاستين","اوكساليبلاتين","اوكساليبلاتين ميداك","اوكساليبلاتن","اوكساليبلاتن ميداك","افاستين","اربيتوكس","ادروسيل","فلورويراسيل","فلوراويوراسيل","فلورويوراسيل","","","","","","","","","");
        mid m24 =new mid("ارتفاع ضغط الدم","كارديوبريل","انجيلات","املور","كاردكس","كارديوبرول","كونكور","لودوز","سيليكتا","زيبيتا","اسيتاب","كابوكارد","كابوتين","كابريل","كابتوفار","نوفو-كابتوريل","","","","","","","","");
        mid m25 =new mid("سرطان البروستاتا","ايمسايت","سوبرفاكت","كاسودسكس","الديكاببتيل","ديكاببتيل","ديكاببتيل","ديكابيبتيل","ديكابيبتيل","زولادكس","يوليكسين","يوليكسين","فيناسيد","فينيسكار","بروهير","بروبيشيا","","","","","","","","");
        mid m26 =new mid("سرطان الجلد","ادروسيل","فلورويراسيل","فلوراويوراسيل","فلورويوراسيل","فلورويوراسيل","","","","","","","","","","","","","","","","","","");
        mid m27 =new mid("الأرق","الميلاتونين","سيراكس","سيريباكس","ليندورم","سينتةنال","ليكسوتان","ليكسوتانيل","كفامول","كوفليو","يونيسوم","فاليوم","دورميكس","يوروفان","امبين","زولبجن","روهيبنول","","","","","","","");
        mid m28 =new mid("سرطان الرئة","تارسيفا","","","","","","","","","","","","","","","","","","","","","","");
        mid m29 =new mid("هشاشة العظم","كالسيتيك","كالسيتيك 200","كالسيتيك","مياكالسيك 100","مياكالسيك","ميكالسيك","بريماران","اليندرو","بوناماكس","بوناماكس اقراص","درولات","فوساماكس","فوزاماكس","ليندوماكس","اوستيو ميفا","اوستيودينز","","","","","","","");
        mid m30 =new mid("التهاب المفاصل االروماتويدي","ميتيكورتين","أوراسون","بريدون","سترابريد","بنسلامين","كبريمين","ديبين","بركسين","ديكساميثازون","فلدين","فيلدين","نوفو-بيروكام","اورثوكامج","","","","","","","","","","");
        mid m31 =new mid("قصور الانتباه وفرط الحركة","ستيراتير10MG","ستيراتير18MG","ستيراتيرا25MG","دواء ستراتيرا","كبسولات ستراتيرا","سيليرت","كونسيرتا","الكونسيرتا","ميتاديت","ميثايلين","ريتالين","","","","","","","","","","","","");
        mid m32 =new mid("الهوس الاكتئابي","زيبادهيرا","زيبادهيرا حقن","زيبريكسا","زيبركسا","ريدون","ريسيدون","ريسبردال كونستا","رزبريدال","سيروكويل","السوركويل","","","","","","","","","","","","","");
        mid m33 =new mid("الألم العضلي الليفي","اكسيل","سافيلا","","","","","","","","","","","","","","","","","","","","","");
        mid m34 =new mid("باركنسون","دوستينكس","الديبريل","زيلابار","ابوكين","يوبريما","بك ميرز","سيميتريل","كومتان","فليكسون","نورفلكس","نورجيسيك","ميرابيكس","ميرابيكس","سيفرول","اقراص سيفرول","كمدرين","","","","","","","");
        mid m35 =new mid("حرقة المعدة","اوبرازول","الوجيل","هايدروجيل","مالوجيل","لوسك","بروبلسيد","دينول","بروكتولار","اميلوك","غاسيك غاسترو","غاسيك غاسترو","اوميبركس","اوميرال","اوميزين","اوميز10MG","اوميز20MG","","","","","","","");
        mid m36 =new mid("كرون","سيبرولون","نيدازول","نيدازول","ازابرين","ازاسان","سيبرولون","اميوران","ايميوران","ريميكاد","ايزوتريكس","زيراكتان","زيركتان","","","","","","","","","","","");
        mid m37 =new mid("السكتة الدماغية","كلوبيكس","بيدوفكس","بلافيكس","بيرسانتين","كتيليز","","","","","","","","","","","","","","","","","","");
        mid m38 =new mid("الأنفلونزا","ريلينزا","بك ميرز","سيميتريل","اوسيلتا","التاميفلو","تاميفلو","","","","","","","","","","","","","","","","","");
        mid m39 =new mid("القولون العصبي","اجيوكيور","زلماك","زيلنورم","ينتيل","ديبينت","شامبيونيل","دوغماتيل","الدوجماتيل","جنبريد","ليبراكس","بيفاكول","دوسبامين","","","","","","","","","","","");
        mid m40 =new mid("النقراس","نوروفين","بيورينول","بورينول 300","اندومين","ابيورول","لوريك اقراص","لوريك","نو يوريك","نو-يوريك اقراص","يروكواد","كونفورتد","زيلوريك","","","","","","","","","","","");
        mid m41 =new mid("الذبحة الصدرية","اسبرين","انجيلات","كيديبرين","املور","كاردكس","كارديوبرول","كونكور","لودوز","سيليكتا","زيبيتا","بيتاتين اقراص","بيتاتين","","","","","","","","","","","");
        mid m42 =new mid("سرطان الغده الدرقية","ادريبلاستينا","ادريبلاستين","دوكسوروبيسين","التروكسين","يوثيروكس","ال -ثيروكس هيكسال","ال ثيروكس ","","","","","","","","","","","","","","","","");
        mid m43 =new mid("سرطان البنكرياس","تارسيفا","جيمسيتابين","جيمسيتابين ايبوي","جمزار","ادروسيل","فلورويراسيل","فلوراويوراسيل","فلورويوراسيل","فلورويوراسيل","ميتوميسين C","","","","","","","","","","","","","");
        mid m44 =new mid("الذئبة","مابثيرا","ريتوكسان","سيكلوفوسفاميد","السيكلوفوسفاميد","سيكلوفوسفامد","سيتوكسان","إندوكسان","اندوكسان","الاندوكسان","ايندوكسان","نيوسار","","","","","","","","","","","","");
        mid m45 =new mid("التهاب المسالك البولية","بيناموكس 125","بيناموكس 250","بيناموكس","بيناموكس كبسولات","اموكلان 1","اموكلان 1.2","اموكلان","اموكلان اقراص","ليفاكوين","ليفاكوين","تافينك","","","","","","","","","","","","");
        mid m46 =new mid("الوسواس القهري","سولوتيك","فافرين","لوفوكس","ديروكسات","باروكسات10","باروكسات20","باروكسيت30","باكسيل","سيروكسات","لوسترال","رياسيرتال","سيترال","انافرانيل","أنافرانيل","","","","","","","","","");
        mid m47 =new mid("التهاب الجيوب المزمن","تريفيد","بيناموكس ","اكتفيد","اكتيفيد","ادول","كولفيد","اوترينول","بنادول","بنادول","ترايفيد","ليفاكوين","","","","","","","","","","","","");
        mid m48 =new mid("التهاب الكبد ب","هيبسيرا","ايمتريفا","باراكلور","دواء باراكلود","سيبيفو","تايزيكا","ايبيفير","ايبيرفير","ايبيفر اقراص","تابيفير","زيفكس","","","","","","","","","","","","");
        mid m49 =new mid("الورم الميلانيني","بروليوكين","تيمودار","ديتيسين","ديتيسين","دروكسيا","هيدريا","ميلوسيل","","","","","","","","","","","","","","","","");
        mid m50 =new mid("الخصية المعلقة","نوفاريل","اوفيدريل","بريغنيل","","","","","","","","","","","","","","","","","","","","");
        mid m51 =new mid("فقر الدم","فيدازا","ابريكس","ايبريكس","ايبركس","ابريكس","الايبركس","الابريكس","الايبريكس","الريكورمون","ريكورمون","ارانسب","","","","","","","","","","","","");
        mid m52 =new mid("السعال المزمن","ايرثروسين 500","ريثينت","ايريسول","ارثيرودار","ارثروميل","ايرثروميل","اوفتالمولوزا","اوماثروسين","بيربرون","ديلسيم","كافوسيد","","","","","","","","","","","","");
        mid m53 =new mid("الاسهال","دي جيل","ابيكوجيل","جافيسكون","مالوكس","ماجالوكس","ميداسيد","موكسال بلس","موكسال بلس اقراص","موكسال ","موكسال اقراص","موكوجيل","نوفاجل","نوفاجيل","","","","","","","","","","");
        mid m54 =new mid("التهاب القصبات الحاد ","زيماكس","زوسين","فلوموسيل","افدرين","امينوفيلين","فيلوكونتين","تروفيلين","تروبلم","اتروبلم","اتروفينت","","","","","","","","","","","","","");
        mid m55 =new mid("طفح الحفاظ","ديسيتين","ارجازان","بيبانثين","كريم بيبانثين","ديكسانول","ديكسيبان","هيلو كير","بانثينول","بانثوفيل","كريم بانثوفيل","","","","","","","","","","","","","");
        mid m56 =new mid("الاكزيما","كينالوج","بانديرم","ارجازان","ديسوين","ديلونيد","نيريزون","ادفانتان","ديبو ميدرول","ميدرول","سولوميدرول","اس او ال يو ميدرول","","","","","","","","","","","","");
        mid m57 =new mid("الزرق","ريالول","ابيكاربين","ايسبوتو","مينيمس","بيلوتينا","لوم","ترافاتان","ابيمول","لوميجان","كومبيجان","","","","","","","","","","","","","");
        mid m58 =new mid("الام الدورة الشهرية","نورفين","اومافين","فوربين","بروف","بروف اقراص","بروف400","بروف600","ريابروفين","سابوفين","دارفون","","","","","","","","","","","","","");
        mid m59 =new mid("التهاب البلعوم الحاد","بيناموكس 125","بيناموكس 250","بيناموكس","بيناموكس كبسولات","امبيسلين","امبيبلاس","امبيبلاس","ابيكوسيللين","ابيكوسيلين","امبيسيلين","ستانداسيلين","ستانداسيلين","","","","","","","","","","","");
        mid m60 =new mid("سلس البول","ايلافيل","أنديب","ساروتين","ساروتين ريتارد","تريبتيزول","ريغورين","سانكتورا","سباسميكس","سباسموليت","","","","","","","","","","","","","","");
        mid m61 =new mid("التهاب الاذن","اكتفيد ","ادول","كولفيد","اوترينول","بنادول","ترايفيد","ازيماك","ازي ونس","ازوماكس","ازوميسين","","","","","","","","","","","","","");
        mid m62 =new mid("القرح الهضمية","لانفاست","لونزيت","بيبتازول","الترازول","سيتوتاك","دي جيل ","ابيكوجيل","جافيسكون","مالوكس","ميداسيد","","","","","","","","","","","","","");
        mid m63 =new mid("التهاب اللثه","ديوموزول","اليزول","اورفيك","هيكسيدين","نيدازول","فورتيبين","البينسيلين","البنسلين","ريتارين","هيبات","هيبيتان","هيبيسكرب","هيباتين","دوموزول","اليزول","","","","","","","","");

        mymid.add(m1);
        mymid.add(m2);
        mymid.add(m3);
        mymid.add(m4);
        mymid.add(m5);
        mymid.add(m6);
        mymid.add(m7);
        mymid.add(m8);
        mymid.add(m9);
        mymid.add(m10);
        mymid.add(m11);
        mymid.add(m12);
        mymid.add(m13);
        mymid.add(m14);
        mymid.add(m15);
        mymid.add(m16);
        mymid.add(m17);
        mymid.add(m18);
        mymid.add(m19);
        mymid.add(m20);
        mymid.add(m21);
        mymid.add(m22);
        mymid.add(m23);
        mymid.add(m24);
        mymid.add(m25);
        mymid.add(m26);
        mymid.add(m27);
        mymid.add(m28);
        mymid.add(m29);
        mymid.add(m30);
        mymid.add(m31);
        mymid.add(m32);
        mymid.add(m33);
        mymid.add(m34);
        mymid.add(m35);
        mymid.add(m36);
        mymid.add(m37);
        mymid.add(m38);
        mymid.add(m39);
        mymid.add(m40);
        mymid.add(m41);
        mymid.add(m42);
        mymid.add(m43);
        mymid.add(m44);
        mymid.add(m45);
        mymid.add(m46);
        mymid.add(m47);
        mymid.add(m48);
        mymid.add(m49);
        mymid.add(m50);
        mymid.add(m51);
        mymid.add(m52);
        mymid.add(m53);
        mymid.add(m54);
        mymid.add(m55);
        mymid.add(m56);
        mymid.add(m57);
        mymid.add(m58);
        mymid.add(m59);
        mymid.add(m60);
        mymid.add(m61);
        mymid.add(m62);
        mymid.add(m63);


RecyclerView rv = findViewById(R.id.RecyclerView);

//سطر ترتيب
        rv.setHasFixedSize(true);
        RecyclerView.LayoutManager ln = new LinearLayoutManager(this);
        rv.setLayoutManager(ln);
        //
myadapter1 adapter = new myadapter1(mymid,this);
rv.setAdapter(adapter);
    }
}