package com.example.final_work;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.TextView;
import android.widget.Toast;

import java.util.Random;

public class n9ay7 extends AppCompatActivity {
    //تعريف المتغيرات
    private TextView factTextView;
    private Button factButton;
String facts[] = {
        "لتقوية جهاز المناعة غسل اليدين باستمرار",
        "لتقوية جهاز المناعة التأكد من حصول الجسم على الفيتامينات",
        "لتقوية جهاز المناعة تناول الطعام الصحي",
        "لتقوية جهاز المناعة تقليل مستوى التوتر",
        "لتقوية جهاز المناعة ممارسة التمارين الرياضية",
        "لتقوية جهاز المناعة النوم لوقت كافي",
        "لتقوية جهاز المناعة الإقلاع عن التدخين",
        "لتقوية جهاز المناعة التعرض لأشعة الشمس",
        "لتقوية جهاز المناعة الراحة النفسيه وتقوية العلاقات الاجتماعية",
        " كن على اتصال دائم مع الآخرين من المهم أن نحافظ على العلاقات السوية والسليمة مع الأشخاص الذين نثق بهم من أجل سلامتنا النفسية والعقلية، لذا عليكم التفكير في كيفية البقاء على اتصال دائم مع الأصدقاء وأفراد العائلة عند الحاجة للمكوث في المنازل.",
        "تحدث عما يثير قلقك إنه لأمر طبيعي أن تشعر بالقلق أو الخوف أو العجز بشأن الوضع الراهن. ولكن تذكر أنه يمكنك إخبار من تثق بهم بمخاوفك؛ إذ يمكن أن يساعدهم ذلك أيضًا.",
        "ادعم الآخرين وقدم يد العون لهم بتقديمك يد العون للآخرين قد يعود ذلك عليك بالمنفعة كذلك، لذا حاول أن تكون أكثر تفهمًا لمخاوف الآخرين أو ما يثير الاضطراب والقلق لديهم أو في حالة تغير سلوكياتهم في هذا الوقت.",
        "  كن دائمًا مستعدًّا التفكير في تبعات المكوث في المنزل يمكن أن يساعدك لتكون أكثر استعدادًا مع تقليل التوتر والقلق. فكر في الأعمال التي تقوم بها في أي أسبوع عادي: كيف سيتأثر عملك؟ وماذا عليك القيام به لحل أي مشكلات؟",
        " اعتنِ بجسدك وصحتك لصحتنا الجسدية تأثير كبير على ما نشعر به. وفي مثل هذه الأوقات، قد يكون من السهل الوقوع في أنماط سلوك غير صحية ينتهي الأمر بك إلى الشعور بالسوء.",
        "حاول تناول الوجبات الصحية والمتوازنة جيدًا وشرب كمية كافية من الماء وممارسة الرياضة بانتظام. تجنب التدخين أو تعاطي المواد المخدرة وحاول ألا تتناول الكثير من المشروبات الكحولية.",
        "حاول التركيز على الأشياء التي يمكنك السيطرة عليها، مثل سلوكك ومع من تتحدث ومن أين تحصل على المعلومات وما عدد مرات الاطلاع على آخر المستجدات.",
        "إذا كنا نشعر بالخوف أو القلق أو الحزن والإحباط، فقد نتوقف عن القيام بالأشياء التي نستمتع بها عادةً. وقد يساعد التركيز على الهوايات المفضلة أو الاسترخاء داخل المنازل أو التواصل مع الآخرين على التخلص من الأفكار والمشاعر المتعلقة بالقلق.",
        "إذا لم تستطع القيام بالأشياء التي تستمتع بها بشكل طبيعي بسبب مكوثك في المنزل، ففكر في كيفية التكيف مع الوضع الحالي أو حاول القيام بشيء جديد.",
        "يُحدث النوم الجيد فرقًا كبيرًا بشأن ما نشعر به ذهنيًّا وجسديًّا، وبالتالي من الضروري الحصول على قسط كافٍ من النوم.",
        "حاول أن تحافظ على أنماط نوم منتظمة مع ممارسة عادات نوم صحية، مثل تجنب استخدام الهواتف المتحركة أو ما يشبهها قبل النوم وتقليل تناول الكافيين وخلق بيئة مريحة وهادئة.",
        "يمكن أن تخفّف النشاطات اليومية البسيطة، مثل المشي، السباحة، العناية بالحديقة والرقص بعض الألم مباشرةً عن طريق منع إرسال إشارات الألم إلى الدماغ. يساعد النشاط أيضاً على تمدّد العضلات المتصلّبة والمتشنّجة، الأربطة والمفاصل، والذي يمكن أن يقلّل الألم.",
        "من الطبيعي أن تكون متردداً إذا كانت ممارسة التمارين مؤلمةً وكنت قلقاً حول حدوث المزيد من الضرر. ولكن إذا أصبحت أكثر نشاطاً تدريجياً، فمن غير المحتمل حدوث أي ضرر أو أذى. يحدث الألم الذي تشعر به عند البدء بالتمارين اللطيفة لأن العضلات والمفاصل تصبح أكثر صحةً.",
        "يمكن أن يساعد التركيز على تنفّسك عند شعورك بالألم. عندما يكون الألم شديداً فإنه من السهل جداً البدء بأخذ أنفاس سطحية وسريعة يمكنها أن تجعلك تشعر بالدوار، القلق أو الذعر. بدلاً من ذلك، تنفس ببطء وبعمق. سيساعدك هذا على الشعور بأنك أكثر سيطرةً على الوضع وسيبقيك مسترخياً ويمنع أي تشنج في العضلات أو قلق من أن يسوء ألمك.",
        "الدليل الإرشادي للألم هو كتيّب مجاني يحتوي نصائح عملية بسيطة عن كيفية التعايش بشكل أفضل مع الألم على المدى الطويل",
        "يمكن أن يُشعرك الألم بالتعب، القلق، الاكتئاب والغضب. يمكن لهذا أن يجعل الألم أسوأ، ويجعلك تقع في دوامة نحو الأسفل. كن أكثر لطفاً مع نفسك. التعايش مع الألم ليس سهلاً ويمكن أن تكون نفسك أسوأ أعدائك إذا كنت عنيداً، لاتمارس نشاطاتك كل يوم   ولا تقبل قيودك. يجد بعض الناس أنه من المفيد طلب المساعدة من مستشار، طبيب نفساني أو أخصائي تنويم مغناطيسي لاكتشاف كيفية التعامل مع مشاعرهم فيما يتعلق بآلامهم. راجع طبيبك للحصول على المشورة والإحالة .",
        "حوّل انتباهك إلى شيء آخر لكي لا يكون الألم الشيء الوحيد في تفكيرك. انخرط في نشاط تستمتع به أو تجده محفزاً. هوايات كثيرة، مثل التصوير الفوتوغرافي، الخياطة أو الحياكة، ممكنة حتى عندما تكون حركتك محدودة.",
        "يعاني الكثير من الناس الذين لديهم ألم مزمن من رهبة الذهاب إلى الفراش عندما يكون الألم في أسوأ حالاته،\" تقول هيذر والاس من الاهتمام بالألم. لكن من المهم أن تحاول التقيّد بروتين نوم عادي لكي تحصل على فرصة أفضل للنوم خلال الليل. أيضاً، \"يمكن أن يجعل الحرمان من النوم الألم أسوأ،\" تقول هيذر. اذهب إلى الفراش في نفس الوقت كل مساء، واستيقظ في وقت منتظم في الصباح وتجنّب أخذ قيلولة في النهار. إذا استمرت مشاكل النوم، راجع طبيبك.",
        "انضم إلى برنامج تدريب للأشخاص الذين يعيشون مع حالات مرضية مزمنة طويلة الأمد مثل التهاب المفاصل لاكتساب مهارات جديدة من أجل التحكم بحالتهم (وأي ألم مرتبط بها) بشكل أفضل على أساس يرمي.",
        "لا تدع الألم يفقدك التواصل مع الناس. فالبقاء على اتصال مع الأصدقاء والأسرة أمر جيد لصحتك ويمكن أن يساعدك لتشعر بالتحسن. جرّب الزيارات القصيرة، ربما مرات أكثر، وإذا كنت لا تستطيع الخروج لزيارة الناس، اتصل بأحد الأصدقاء، قم بدعوة أحد أفراد الأسرة لتناول القهوة أو قم بالدردشة مع جارك. قم بالحديث عن أي شيء أخر غير ألمك، حتى إذا أراد الناس التحدث عن ذلك.",
        "يمكن أن يساعد اتباع تقنيات الاسترخاء بانتظام في التقليل من الألم المستمر. هناك أنواع عديدة من تقنيات الاسترخاء، تتفاوت بين تمارين التنفس و أنواع من التأمل. إطلب نصيحة طبيبك في المقام الأول. قد تتواجد صفوف متاحة محلياً أو في عيادة الألم في المستشفى المحلي.",
        "مارس تمارين الظهر بانتظام. إن المشي و السباحة (خصوصاً السباحة على الظهر) واستخدام دراجات التمرين كلها طرق ممتازة لتقوية عضلات ظهرك.",
        "احنِ ركبتيك و وركيك دائماً، و ليس ظهرك.",
        "لا تقم أبداً باللوي والثني في نفس الوقت.",
        "ارفع واحمل الأشياء قريباً من الجسم دائماً.",
        "حاول دائماً أن تحمل الأوزان الأكبر في حقيبة ظهر و تجنب الحقائب الجانبية.",
        "حافظ على تموضع جيد. تجنّب الانزلاق في كرسيك، أو الانحناء على مكتب أو المشي مع كتفيك في وضعية منحنية.",
        "استخدم كرسي ذو مسند للظهر. اجلس مع قدميك في وضعية مسطحة على الأرض أو على مسند للقدمين. غيّر طريقة جلوسك كل بضع دقائق.",
        "أقلع عن التدخين إذ يُعتقد أن التدخين يحد من وصول الدم إلى الأقراص بين الفقرات مما قد يؤدي إلى تراجع هذه الأقراص.",
        "تخلص من أي وزن زائد. يمكنك استخدام   حاسبة الوزن الصحي لمعرفة ما إذا كان وزنك مناسباً لطولك.",
        "اختر فراشاً ملائماً فراش لطولك، وزنك، عمرك، ووضعية نومك.",
        "هناك حل لأية مشكلة. إذا بقيت سلبياً، تفكر، 'لا أستطيع أن أفعل أي شيء حيال مشكلتي'، فسوف يزداد التوتر سوءا، كما يقول البروفيسور كوبر. هذا الشعور من فقدان السيطرة هو واحد من الأسباب الرئيسية للتوتر و الحالة الصحية.",
        "لا تعتمد على الكحول، التدخين و الكافيين كطريقة للتغلب على المشاكل. \"غالباً ما يلجأ الرجال أكثر من النساء لهذه الأمور. و نحن نسمي هذا سلوك التهرّب \"، يقول البروفيسور كوبر. \"المرأة أفضل من الرجل في الحصول على دعم من دائرتهن الاجتماعية.",
        "التنظيم الجيد للوقت يعني نوعية العمل و ليس كميته. إن ثقافة العمل لساعات طويلة سبب معروف لأمراض العمل. \"عليك الحصول على توازن بين العمل و الحياة مناسب لك\"، كما يقول البروفيسور كوبر.\n",
        "ابحث عن الإيجابيات في الحياة، والأشياء التي تشعر بالامتنان لامتلاكها. قم في نهاية كل يوم بكتابة ثلاثة أشياء سارت على ما يرام أو جعلتك تشعر بالامتنان.",
        "لا يعدّ تغيير وضع صعب أمراُ ممكناً دائماً. إذا كان الحال كذلك، فعليك الاعتراف و قبول الأشياء كما هي و التركيز على الأمور التي يمكنك أن تتحكم بها .",
};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_n9ay7);

        //تعين المتغيرات
        factTextView = (TextView) findViewById(R.id.factTextView);
        factButton = (Button) findViewById(R.id.factButton);

        View.OnClickListener onClickListener = new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //هنا سيتم تغير الحقيقة في البرنامج


                Random randomGen = new Random();
                int randomNumber = randomGen.nextInt(facts.length);
                String fact = facts[randomNumber];
                factTextView.setText(fact);
            }
        };
        factButton.setOnClickListener(onClickListener);
    }
}